
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ИспользуемоеИмяФайла = РеквизитФормыВЗначение("Объект").ИспользуемоеИмяФайла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапуститьБраузер() Экспорт
	
	ПутьКАрхиву = ПолучитьИмяВременногоФайла("zip");
	ПолучитьИзВременногоХранилища(
		ПоместитьМакетВоВременноеХранилище("БраузерТестирования"))
		.Записать(ПутьКАрхиву);
		
	ВременныйКаталогБраузера = КаталогДокументов() + "БраузерТестирования\";
	УдалитьФайлы(ВременныйКаталогБраузера, "*.*");
	
	ЧтениеZIP = Новый ЧтениеZipФайла(ПутьКАрхиву);
	ЧтениеZIP.ИзвлечьВсе(ВременныйКаталогБраузера, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	
	Оповещение = Новый ОписаниеОповещения("ЗапуститьБраузерЗавершение", ЭтотОбъект);
	НачатьПомещениеФайлов(Оповещение, ,ВременныйКаталогБраузера+ "*.epf",Ложь,ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьБраузерЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	Для Каждого ОписаниеФайла Из ПомещенныеФайлы Цикл
		ИмяОбработки = ПодключитьВнешнююОбработкуНаСервере(ОписаниеФайла.Хранение);
		
		Если Найти(ВРег(ОписаниеФайла.Имя), ВРег("xddTestRunner.epf")) Тогда
			ИмяОбработкиБраузер = ИмяОбработки;
			ПутьКОбработкеБраузер = ОписаниеФайла.Имя;
		КонецЕсли;
		
	КонецЦикла;
	
	Форма = ПолучитьФорму("ВнешняяОбработка." + ИмяОбработкиБраузер + ".ФормаОбъекта");
	Форма.ИспользуемоеИмяФайла = ПутьКОбработкеБраузер;
	
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПоместитьМакетВоВременноеХранилище(ИмяМакета)
	
	ДвоичныеДанные = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

&НаКлиенте
Функция ПодключитьВнешнююОбработкуНаКлиенте(ПутьКФайлуНаКлиенте)
    АдресХранилища = "";
	ПоместитьФайл(АдресХранилища, ПутьКФайлуНаКлиенте, , Ложь);
	ИмяОбработки = ПодключитьВнешнююОбработкуНаСервере(АдресХранилища);
	Возврат ИмяОбработки;
КонецФункции

&НаСервере
Функция ПодключитьВнешнююОбработкуНаСервере(АдресХранилища)
	Возврат ВнешниеОбработки.Подключить(АдресХранилища,,Ложь);
КонецФункции

#КонецОбласти
